load-tests/build-14/k6-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 288 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 427 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 599 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 602 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 700 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 779 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 800 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 900 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 930 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 1000 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 1096 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 1106 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 1200 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 1300 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 1429 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 1500 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 1592 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 1609 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 1765 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 1801 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 1899 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 1928 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 2000 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 2088 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 2110 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 2199 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 2259 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 2303 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 2396 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 2432 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 2501 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 2585 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 2612 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 2699 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 2756 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 2805 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 2896 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 2932 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 3001 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 3080 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 3115 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 3201 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 3260 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 3307 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 3397 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 3428 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 3501 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 3578 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 3618 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 3701 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s

running (1m01.0s), 050/100 VUs, 3751 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s
time="2026-07-23T09:35:53Z" level=error msg="TypeError: Cannot read property 'toFixed' of undefined or null\n\tat handleSummary (file:///home/runner/work/imageauthenticity-pdd/imageauthenticity-pdd/load_test.js:134:64(76))\n" hint="script exception" source=stacktrace


  █ THRESHOLDS 

    history_success_rate
    ✓ 'rate>0.90' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=158.61ms
    ✓ 'p(99)<5000' p(99)=190.66ms

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%

    login_success_rate
    ✓ 'rate>0.90' rate=100.00%

    verify_success_rate
    ✓ 'rate>0.85' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 45612   740.711479/s
    checks_succeeded...: 100.00% 45612 out of 45612
    checks_failed......: 0.00%   0 out of 45612

    ✓ Login: status 200
    ✓ Login: has token
    ✓ Login: duration < 2000ms
    ✓ Verify: status 200
    ✓ Verify: has prediction
    ✓ Verify: duration < 3000ms
    ✓ History: status 200
    ✓ History: is array
    ✓ History: duration < 1500ms
    ✓ Profile: status 200
    ✓ Profile: has name
    ✓ Profile: duration < 1000ms

    CUSTOM
    history_duration_ms............: avg=0.244936  min=0     med=0        max=3        p(90)=1        p(95)=1       
    history_success_rate...........: 100.00% 3801 out of 3801
    login_duration_ms..............: avg=0.826361  min=0     med=0        max=34       p(90)=1        p(95)=1       
    login_success_rate.............: 100.00% 3801 out of 3801
    total_requests.................: 15204   246.903826/s
    verify_duration_ms.............: avg=99.199947 min=0     med=98       max=200      p(90)=179      p(95)=189     
    verify_success_rate............: 100.00% 3801 out of 3801

    HTTP
    http_req_duration..............: avg=25.06ms   min=109µs med=195.23µs max=200.01ms p(90)=118.35ms p(95)=158.61ms
      { expected_response:true }...: avg=25.06ms   min=109µs med=195.23µs max=200.01ms p(90)=118.35ms p(95)=158.61ms
    http_req_failed................: 0.00%   0 out of 15204
    http_reqs......................: 15204   246.903826/s

    EXECUTION
    iteration_duration.............: avg=1.6s      min=1.5s  med=1.6s     max=1.71s    p(90)=1.68s    p(95)=1.69s   
    iterations.....................: 3801    61.725957/s
    vus............................: 50      min=50           max=100
    vus_max........................: 100     min=100          max=100

    NETWORK
    data_received..................: 4.5 MB  74 kB/s
    data_sent......................: 2.8 MB  45 kB/s



running (1m01.6s), 000/100 VUs, 3801 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s